Logicenios/C5VRX/sdkconfig.defaults
# C5VRX shared ESP-IDF defaults (all boards).
# Per-board settings (flash, board choice) live in sdkconfig.defaults.<env>,
# layered by platformio.ini via -DSDKCONFIG_DEFAULTS (docs/BOARDS.md).

CONFIG_IDF_TARGET="esp32c5"

# ----- CPU & clock -----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# ----- Silicon workaround -----
# ESP32-C5: executing "cm.push" (RISC-V ZCMP) can re-enable interrupts in
# critical sections; IDF 6.0.2/6.1-rc1 then crash early on rev v1.0
# (espressif/esp-idf#18886). The FreeRTOS fix is on IDF master only
# (104f8ff55b), not in v6.1.0. Keep ZCMP off (docs/BOARDS.md).
CONFIG_COMPILER_ENABLE_RISCV_ZCMP=n

# ----- Partition table -----
# bootloader + nvs + phy_init + 3 MB factory app; fits 4 MB and 8 MB flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ----- Console / USB -----
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# ----- FreeRTOS -----
CONFIG_FREERTOS_HZ=1000

# ----- Logging -----
# WARN globally; boot diagnostics (board, chip revision, antenna, RF) log at W.
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

# ----- Wi-Fi (receive-only use; docs/refactor/00-recon.md §3) -----
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n

# ----- Wireless: Wi-Fi only, no Bluetooth, no 802.15.4, no coexistence -----
CONFIG_IEEE802154_ENABLED=n
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=n

# ----- PHY -----
# Cert-test library (TX tone / continuous TX entry points) is not linked:
# receive-only firmware (recon §3 T7).
CONFIG_ESP_PHY_ENABLE_CERT_TEST=n
CONFIG_ESP_PHY_DEBUG=y
CONFIG_ESP_PHY_DISABLE_PLL_TRACK=y

# ----- Power management -----
CONFIG_PM_ENABLE=n
